# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)

# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 7 10
# Вывод: [1, 9, 13, 14, 19]

import random


#a = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

a=[]

for i in range(20):
            a.append(random.randrange(-9,11))

mina = 2
maxa = 8
ai = []

print(a)
print(f'Минимальное значение {mina}, максимальное значение {maxa}') 

for i in range(len(a)):
    if  mina <= a[i] and a[i] <= maxa:
        ai.append(i)

print(ai)
